print ('privet')
# 2+2 - выражение - это наиболие фундаметальная разновидность программных инструкций языка
#2 - щначение
#+ - оператор
# ** - степень; % - остаток; // - целочисленное деление
#int float str
#конкатенация строк 'abc' + 'def'
#репликация строк 'abc' * 2 -> abcabc
#переменная - область памяти компьютера, в которой может храниться одиночное значение
#инициализация, перезапись переменных, имена переменых чуствительны к регистру, имена переменных должны начинаться с маленькой буквы
#хороший стиль вместо looking_like_this  lookingLikeThis
#
####################
